/*Դասի առաջադրանքը

1)Ստեղծեք numberOfFilms փոփոխական և նրր մեջ տեղադրեք օգտատերի հարցի պատասխանը
«Քանի՞ ֆիլմ եք տեսել»

2)ստեղծել personalMovieDB օբյեկը և նրա մեջ տեղադրել հետևյալ հատկանիշները
    - count -  այստեղ փոխանցեք առաջին հարցի պատասխանը
    - movies - այս հատկանիշի մեջ տեղադրեղ դատարկ օբյկտ
    - actors - նույնպես տեղադրեք դատարկ օբյեկտ
    - genres - այստեղ տեղադրեք դատարկ զանգված
    - private - այստեղ տեղադրեք boolean(տրամաբանական) նշանակություն false
    
3) Տվեք օգտատերին 2 անգամ հարցեր
    - 'Վերջին դիտած ֆիլմը'
    - 'Որքան կգանհատեք այն'

3) Задайте пользователю по два раза вопросы
    - 'Один из последних просмотренных фильмов'
    - 'На сколько оцените его'

Պատասխանը տեղադրեք առանձին փոփոխականի մեջ
Պատասխանը գրեք movies օբյեկտի մեջ

    movies {
        'logan' '8.1'
    }

Ստուգեք որպիս կոնսլում աշխատի առանց սխալների -*/
"use strict";


const numberOfFilms = +prompt('Քանի՞ ֆիլմ եք տեսել', '');


const personalMovieDB = {
     count: numberOfFilms,//այստեղ փոխանցվում է պատասխանը առաջին հարցի
     movies: {},
     actors: {},
     genres: [],
     pivate: false
};


const a = prompt('Վերջին դիտած ֆիլմը', ''),//Ստեղծումենք տեխնիկական փոփոխականնր մենք իմաստալից չենք անվանում քանի որ նրանք կոդում մեկ անգամ են հանդիպելու
      b = prompt('Որքան՞ կգանհատեք այն', ''),
      c = prompt('Վերջին դիտած ֆիլմը', ''),  
      d = prompt('Որքան՞ կգանհատեք այն', '');
      

personalMovieDB.movies[a] = b;
personalMovieDB.movies[c] = d;
console.log(personalMovieDB);

